
const speachNodes = {
    "Приветствие":{    "child": [
        "Нет интернета",
        "Низкая скорость",
        "Уточнить номер договора",
        "Уточнить время заявки",
        "Частые пропадания"
      ], 
                    "text": "Здравствуйте это компания Feonet, оператор _____ чем могу помочь"}
    }


const actNodes={
    "Заявка на ближайшее время":{"child":[], "text":""},
    "Перезагрузить роутер":{"child":[], "text":""},
    "Обновить сессию":{"child":[], "text":""},
}

const factNodes = {
    "Нет интернета":{"child":["Нет сессии", "IPoE абонент", "PPPoE абонент", "GPON абонент", "Недостаточно средств"], 
                    "text":""},
    
    "Нет сессии":{"child":[], "text": ""},
    "IPoE абонент":{"child":[], "text":""},
    "PPPoE абонент":{"child":[], "text":""},
    "GPON абонент":{"child":[], "text":""},
    "Подключен оптикой":{"child":[], "text":""},
    "Недостаточно средств":{"child":[], "text":""},
    
    "Есть сессия":{"child":[], "text": ""},
    "Подключен к wifi":{"child":[], "text":""},

    "Уточнить номер договора":{"child":[], "text":""},
    
    "Низкая скорость":{"child":[], "text":""},
    "Частые пропадания":{"child":[], "text":""},
    "Уточнить время заявки":{"child":[], "text":""},
    "Отменить заявку":{"child":[], "text":""},
}

const allNodes = {...speachNodes, ...actNodes, ...factNodes}

export default allNodes